# SetTextLeading

## Description
Procedure SetTextLeading sets the line spacing of the referenced text object to a custom leading value (in points).

```pascal
PROCEDURE SetTextLeading(
				theText : HANDLE;
				leading : REAL);
```

```python

def vs.SetTextLeading(theText, leading):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theText|HANDLE|Handle to text object.|
|leading|REAL|Custom leading value for text.|

## Version
Availability: from VectorWorks8.0
## Category
* Objects - Text